turbulence_models/SA_Detailed/Check/Setup/0.orig/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
40747
(
1.64964e-05
8.59534e-11
1.14596e-10
1.64962e-05
1.99561e-05
1.07173e-10
1.2642e-10
1.99559e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
65
(
-1.64965e-05
-1.99562e-05
-2.41416e-05
-2.92048e-05
-3.53298e-05
-4.27395e-05
-5.17031e-05
-6.25467e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
113
(
3.56794e-05
3.87762e-05
4.21419e-05
4.57996e-05
4.97748e-05
5.40951e-05
5.87904e-05
6.38931e-05
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
